Revit 2024 API
BuiltInFailures.AutoRouteFailures.SegmentsAngleTooGreatError Property
 The resulting angle between the segments is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SegmentsAngleTooGreatError { get; }
Visual Basic
Public Shared ReadOnly Property SegmentsAngleTooGreatError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SegmentsAngleTooGreatError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace